


......................... mininet tutorial ........................

.. with the mininet we can create custom network for our testing.
.. like --topo single we have one switch with two connected host like
.. below.

root@mininet-vm:~# mn --topo single --mac --switch ovsk --controller remote
*** Creating network
*** Adding controller
Unable to contact the remote controller at 127.0.0.1:6633
*** Adding hosts:
h1 h2
*** Adding switches:
s1
*** Adding links:
(h1, s1) (h2, s1)
*** Configuring hosts
h1 h2
*** Starting controller
c0
*** Starting 1 switches
s1
*** Starting CLI:
mininet>
mininet>
mininet> nodes
available nodes are:
c0 h1 h2 s1
mininet>
mininet> exit
*** Stopping 1 controllers
c0
*** Stopping 1 switches
s1 ..
*** Stopping 2 links

*** Stopping 2 hosts
h1 h2
*** Done
completed in 12.191 seconds

.. above command creates a switch of two connected hosts while following command.
.. create a topology of 3 connected host with only one switch.

root@mininet-vm:~#
root@mininet-vm:~# mn --topo single,3 --mac --switch ovsk --controller remote
*** Creating network
*** Adding controller
Unable to contact the remote controller at 127.0.0.1:6633
*** Adding hosts:
h1 h2 h3
*** Adding switches:
s1
*** Adding links:
(h1, s1) (h2, s1) (h3, s1)
*** Configuring hosts
h1 h2 h3
*** Starting controller
c0
*** Starting 1 switches
s1
*** Starting CLI:
mininet>
mininet> nodes
available nodes are:
c0 h1 h2 h3 s1
mininet>

.. --topo option linear creates two switches with one host connectd in each.

root@mininet-vm:~# mn --topo linear --mac --switch ovsk --controller remote
*** Creating network
*** Adding controller
Unable to contact the remote controller at 127.0.0.1:6633
*** Adding hosts:
h1 h2
*** Adding switches:
s1 s2
*** Adding links:
(h1, s1) (h2, s2) (s2, s1)
*** Configuring hosts
h1 h2
*** Starting controller
c0
*** Starting 2 switches
s1 s2
*** Starting CLI:
mininet>
mininet> nodes
available nodes are:
c0 h1 h2 s1 s2
mininet>

.. --topo linear,3 creates three switches with one host of each.

root@mininet-vm:~# mn --topo linear,3 --mac --switch ovsk --controller remote
*** Creating network
*** Adding controller
Unable to contact the remote controller at 127.0.0.1:6633
*** Adding hosts:
h1 h2 h3
*** Adding switches:
s1 s2 s3
*** Adding links:
(h1, s1) (h2, s2) (h3, s3) (s2, s1) (s3, s2)
*** Configuring hosts
h1 h2 h3
*** Starting controller
c0
*** Starting 3 switches
s1 s2 s3
*** Starting CLI:
mininet>
mininet> nodes
available nodes are:
c0 h1 h2 h3 s1 s2 s3
mininet>
mininet>

.. same like above --topo linear,4 creates 4 switches and 4 hosts.

root@mininet-vm:~# mn --topo linear,4 --mac --switch ovsk --controller remote
*** Creating network
*** Adding controller
Unable to contact the remote controller at 127.0.0.1:6633
*** Adding hosts:
h1 h2 h3 h4
*** Adding switches:
s1 s2 s3 s4
*** Adding links:
(h1, s1) (h2, s2) (h3, s3) (h4, s4) (s2, s1) (s3, s2) (s4, s3)
*** Configuring hosts
h1 h2 h3 h4
*** Starting controller
c0
*** Starting 4 switches
s1 s2 s3 s4
*** Starting CLI:
mininet>
mininet> nodes
available nodes are:
c0 h1 h2 h3 h4 s1 s2 s3 s4
mininet>
mininet>

.. controller options: has the following options like below. controller ip is the
.. host ip where the pox or other controller is running. this host can be localhost
.. or vmware host or host or another host within network or another network.
.. listening port is the port where pox or controller is listening on.

root@masum # mn --controller=remote,ip=[controller IP],port=[controller listening port]
