### creation of user and max-fail try
username masum password qv0ddXXa95bgn38c encrypted privilege 15

ciscoasa(config)#aaa local authentication attempts max-fail 3
ciscoasa(config)# 

!
aaa-server radius_server protocol radius
aaa-server radius_server (dmz1) host 192.168.1.3
 key testing123
 authentication-port 1812
aaa authentication enable console radius_server LOCAL
aaa authentication ssh console radius_server LOCAL
aaa authentication telnet console radius_server LOCAL
aaa authentication match www-allow outside radius_server
aaa proxy-limit 14
aaa local authentication attempts max-fail 3
!

### to see the user logged in asa


ciscoasa(config)# show aaa local user 
Lock-time  Failed-attempts	Locked	User
    -   		0	N	masum
ciscoasa(config)# 

### if any user lock down method to un-lock them 

ciscoasa(config)# clear aaa local user ?             

exec mode commands/options:
  fail-attempts  Clear local AAA users fail attempts
  lockout        Clear locked out local AAA users

ciscoasa(config)# clear aaa local user lockout ?

exec mode commands/options:
  all       Clear all the locked users
  username  Username of the locked-user

ciscoasa(config)# clear aaa local user lockout username ?

exec mode commands/options:
  WORD  Specify the username of the locked user

ciscoasa(config)# clear aaa local user lockout username 


