

.............................. virtual firewall or security context ...............................


.. virtual firewall will allow us to configure multiple virtual firewalls in a single physical asa.
.. which has another name, the security context. this can be configured once when asa is placed in
.. multiple mode.


ciscoasa# show mo?

  mode    monitor-interface

ciscoasa# show mode
Security context mode: single
ciscoasa#
ciscoasa#
ciscoasa# config t

ciscoasa(config)# mode  ?

configure mode commands/options:
  multiple   Multiple mode; mode with security contexts
  noconfirm  Do not prompt for confirmation
  single     Single mode; mode without security contexts

ciscoasa(config)# mode

.. therefore we got three modes there namely multiple noconfirm and single. as shown above
.. our router now running on single mode. there are some limitations also when the firewall
.. running on multiple mode. the following services are not available when firewall runs
.. multiple mode.

.. ipsec
.. ssl vpn
.. dynamic routing protocols
.. threat detection
.. multicast ip routing

.. system configuration which is the container for the other security context also critical
.. for the asa operation. when an asa run in single mode it holds system configuration as
.. startup configuration in the flash memory.

.. when a security context need to access any resource of asa, system admin assigns that
.. resource to another context, the special one, the admin context instead of assigns
.. directly. when a user log in a security context, he holds the full administrative power
.. over that security context. creating a security context will not automatically assigns any
.. interface to it. but only admin context can holds all the interface configured even
.. in single configuration mode.

.. which security context to follow when an incoming packets reached to asa is determined
.. by classifier algorithm. it has three rules to follow.

.. unique interface: this is default mode for firewall in transparent mode as interface cannot
.. be shared in this mode.
.. unique mac address: an unique mac address is used and can be determined by asa automatically
.. nat: when the others are not used then used nat normally its mapped to global address.

.. when the firewall is in trasparent mode we cant use the shared interface mode.
.. if it is in routed mode then can use the shared interface mode only when they are connect
.. to the same network. if they need to connect different network we cant use the shared
.. interface feature.

.. moreover we have to use transparent mode for all other security context if we need to use
.. transparent mode. we cant use per security context like few in transparent and few security
.. context are in different.

.. first configure the transparent mode then configure security context otherwise security
.. context configuration will be removed.only two interfaces are permitted when security context
.. running in transparent mode.

.. when using the shared interface try to assign the uniqe mac address to the each context.
.. we have to use the content resource management to ensure that security contexts are not
.. consuming all the resources.

.. and the number of security context we can configure is depends on license we have purchase.
.. like below.

ciscoasa(config)# show version | grep Context
Security Contexts           : 2
ciscoasa(config)#

.. as we can see we can only configure two security contexts.

................ configuration consideration of security context.....................

Step 1. Enable multiple mode on the Cisco ASA.
Step 2. Create a Security Context.
Step 3. Allocate interfaces to the context.
Step 4. Specify the startup configuration location for the context.
Step 5. Configure the Security Context resource management.
Step 6. Configure each Security Context as a separate security appliance.


.. now configure step by step. as soon as we force asa to operate in multiple
.. mode the following thing happens one by one.

ciscoasa(config)# mode noconfirm ?
configure mode commands/options:
  multiple  Multiple mode; mode with security contexts
  single    Single mode; mode without security contexts
ciscoasa(config)# mode noconfirm multiple

.. one admin context created. the running system config converted to system
.. configuration and it stored in flash as admin.cfg

ciscoasa(config)# show context
Context Name      Interfaces           		URL
*admin            Ethernet0,Ethernet1,Ethernet2 flash:/admin.cfg
Total active Security Contexts: 1

ciscoasa(config)#
ciscoasa(config)# show flash:
Directory of flash:/

9      -rw-  13          21:11:41 Sep 10 2015  masum.cfg
10     -rw-  177         22:01:36 Sep 10 2015  index.html
11     -rw-  3995        02:46:56 Aug 25 2016  starttt
12     -rw-  3947        03:41:14 Aug 30 2016  old_running.cfg
13     -rw-  3537        03:41:14 Aug 30 2016  admin.cfg

16128000 bytes total (16107520 bytes free)
ciscoasa(config)#

.. previous running config stored as old_running.cfg
.. all the enabled interfaces are added to the admin context and no of the
.. interface are not currently added to any security context

ciscoasa(config)# show context
Context Name      Interfaces           		URL
*admin            Ethernet0,Ethernet1,Ethernet2 flash:/admin.cfg
Total active Security Contexts: 1

.. see here only three interfaces are added though there are 5 interfaces in the asa because of
.. these there were activated in single mode.

.. moreover no context will be operational as long as
.. we dont give it any location for context startup configuration. and the
.. admin context must be in internal flash (disk0:/flash:) and
.. with the URL syntax to indicate location.

.. now creating one context name masumcontext as testing

ciscoasa(config)# context masumcontext
Creating context 'masumcontext'... Done. (2)
ciscoasa(config-ctx)# ?

Context configuration commands:
  allocate-interface   Allocate interface to context
  config-url           Configure URL for a context configuration
  description          Provide a description of the context
  exit                 Exit from context configuration mode
  help                 Interactive help for context subcommands
  join-failover-group  Join a context to a failover group
  no                   Negate a command
ciscoasa(config-ctx)# description test masum context
  exit                 Exit from context configuration mode
  help                 Interactive help for context subcommands
  join-failover-group  Join a context to a failover group
  no                   Negate a command
ciscoasa(config-ctx)# config-url ?

context mode commands/options:
  flash:  A URL beginning with this prefix for the context's config (file need
          not exist)
  ftp:    A URL beginning with this prefix for the context's config (file need
          not exist)
  http:   A URL beginning with this prefix for the context's config (file need
          not exist)
  https:  A URL beginning with this prefix for the context's config (file need
          not exist)
  tftp:   A URL beginning with this prefix for the context's config (file need
          not exist)
ciscoasa(config-ctx)# allocate-interface Ethernet0
ciscoasa(config-ctx)# allocate-interface Ethernet1
ciscoasa(config-ctx)#
ciscoasa(config-ctx)# show context
Context Name      Interfaces           		URL
*admin            Ethernet0,Ethernet1,Ethernet2 flash:/admin.cfg
 masumcontext     Ethernet0,Ethernet1           flash:/admin.cfg

Total active Security Contexts: 2
ciscoasa(config-ctx)#

.. we use changeto to roam context to context in priviledge mode

Type help or '?' for a list of available commands.

ciscoasa> ena
Password: *****
ciscoasa#
ciscoasa# show context
Context Name      Interfaces           		URL
*admin            Ethernet0,Ethernet1,Ethernet2 flash:/admin.cfg
 masumcontext     Ethernet0,Ethernet1           flash:/admin.cfg

Total active Security Contexts: 2
ciscoasa#
ciscoasa# changeto context admin

ciscoasa/admin# changeto context masumcontext
ciscoasa/masumcontext#

ciscoasa# show mode
Security context mode: multiple
ciscoasa#
ciscoasa# show run

admin-context admin
context admin
  allocate-interface Ethernet0
  allocate-interface Ethernet1
  allocate-interface Ethernet2
  config-url flash:/admin.cfg
!

context masumcontext
  description test masum context
  allocate-interface Ethernet0
  allocate-interface Ethernet1
  config-url flash:/admin.cfg
!

Cryptochecksum:43fffda0faeb95420fe8c7e99db7a120
: end
ciscoasa#

.. configuring an unique mac address is good for different security context.
.. we can configure unique mac address by ourself or let asa to do so automatically.

.. if we need ever to change admin-context from admin to other we do that following

ciscoasa(config)# show context
Context Name      Interfaces           		URL
*admin            Ethernet0,Ethernet1,Ethernet2 flash:/admin.cfg
 masumcontext     Ethernet0,Ethernet1           flash:/admin.cfg

Total active Security Contexts: 2
ciscoasa(config)#
ciscoasa(config)# admin-context masumcontext
ciscoasa(config)#
ciscoasa(config)# show context
Context Name      Interfaces           		URL
 admin            Ethernet0,Ethernet1,Ethernet2 flash:/admin.cfg
*masumcontext     Ethernet0,Ethernet1           flash:/admin.cfg

Total active Security Contexts: 2
ciscoasa(config)#

.. note here now masumcontext is the admin context with a asteric at the
.. front.

.. note: deleting a context will not remove all the configuration.we have to
.. delete it manually.

.. the following way we configure the resource class and make security context
.. to this member. resource class is made with the intension of limiting
.. a security context to consume all the resource of the system.

.. finally. we will have to configure each context manually like we did
.. as single mode asa. nat,ssh and other service we have to configure them
.. manually.

.. if ever we dont need to operate our asa in multiple mode we can revert back
.. to single mode by following.

ciscoasa(config)# mode ?

configure mode commands/options:
  multiple   Multiple mode; mode with security contexts
  noconfirm  Do not prompt for confirmation
  single     Single mode; mode without security contexts

ciscoasa(config)# mode noconfirm ?

configure mode commands/options:
  multiple  Multiple mode; mode with security contexts
  single    Single mode; mode without security contexts

ciscoasa(config)# mode noconfirm single

.. we need to load our previous saved configuration to running-config
.. like following.

ciscoasa# show flash:

Directory of flash:/

9      -rw-  13          21:11:41 Sep 10 2015  masum.cfg
10     -rw-  177         22:01:36 Sep 10 2015  index.html
11     -rw-  3995        02:46:56 Aug 25 2016  starttt
12     -rw-  3947        03:41:14 Aug 30 2016  old_running.cfg
13     -rw-  3537        03:41:14 Aug 30 2016  admin.cfg

16128000 bytes total (16103936 bytes free)
ciscoasa#
ciscoasa# copy flash:/starttt running-config

Source filename [starttt]?

Destination filename [running-config]?

ERROR: DNS Duplicate server address 4.2.2.1
ERROR: DNS Duplicate server address 4.2.2.2
Adding obj (icmp-object echo) to grp (icmp-traffic) failed; object already exists
Adding obj (icmp-object echo-reply) to grp (icmp-traffic) failed; object already exists
Adding obj (icmp-object time-exceeded) to grp (icmp-traffic) failed; object already exists
Adding obj (icmp-object traceroute) to grp (icmp-traffic) failed; object already exists
Adding obj (icmp-object unreachable) to grp (icmp-traffic) failed; object already exists
Adding obj (network-object 192.168.244.0 255.255.255.0) to grp (inside) failed; object already exists
Adding obj (network-object 192.168.35.0 255.255.255.0) to grp (dmz1) failed; object already exists
Adding obj (network-object 10.10.10.0 255.255.255.0) to grp (outside) failed; object already exists
Adding obj (protocol-object tcp) to grp (services) failed; object already exists
Adding obj (protocol-object udp) to grp (services) failed; object already exists
Adding obj (protocol-object icmp) to grp (services) failed; object already exists
Adding obj (protocol-object tcp) to grp (ssh-allow) failed; object already exists
Adding obj (protocol-object 22) to grp (ssh-allow) failed; object already exists
WARNING: <www-allow> found duplicate element
WARNING: <www-allow> found duplicate element
WARNING: <www-allow> found duplicate element
WARNING: <www-allow> found duplicate element
WARNING: <access-list-dmz1> found duplicate element
ERROR: <icmp-allow> element cannot be created
global for this range already exists
global for this range already exists
Duplicate NAT entry
.Duplicate NAT entry
Range already exists.
Range already exists.
Range already exists.
Range already exists.
ERROR: entry for address/mask = 0.0.0.0/0.0.0.0 exists
ERROR: entry for address/mask = 0.0.0.0/0.0.0.0 exists
ERROR: entry for address/mask = 0.0.0.0/0.0.0.0 exists
ERROR: entry for address/mask = 0.0.0.0/0.0.0.0 exists
WARNING: Policy map policy-dmz1 is already configured as a service policy
WARNING: Policy map policy-dmz1 is already configured as a service policy

Cryptochecksum (unchanged): 768fa2bf aa184ebd 964fce26 3acad430

3995 bytes copied in 4.140 secs (998 bytes/sec)

ciscoasa#

............................... EOF ..............................................
