
...................... asa in transparent mode ..................

.. there are two differents mode of operation of an asa firewall.
.. one is routed more another is transparent mode or bridge mode.
.. we can check which mode the asa is running on by the following 
.. command

.. when we enter the transparent mode the previous configuration 
.. will be cleared out and therefore we have to configure the
.. transparent mode from the scratch.

.. therefore it is always better to save the running config to
.. flash or external device before continuing.

ciscoasa# show firewall 
Firewall mode: Router
ciscoasa# 
ciscoasa# config t
ciscoasa(config)# firewall ? 
configure mode commands/options:
  transparent  Switch to transparent mode

..
.. switch to transparent mode like below
..  

ciscoasa(config)# firewall transparent 
pixfirewall(config)# 
pixfirewall(config)# show firewall 
Firewall mode: Transparent
pixfirewall(config)# 


.. now when we configure the interface we provide the following

.. interface speed and duplex mode
.. interface name
.. security level
.. bridge group number


ciscoasa(config)#interface fastEthernet 0/0

ciscoasa(config-if)#bridge-group ?
  <1-255>  Assign an interface to a Bridge Group.

ciscoasa(config-if)#bridge-group 1
ciscoasa(config-if)#no shut
ciscoasa(config-if)#
ciscoasa(config-if)#exit

ciscoasa(config)#interface fastEthernet 0/1
ciscoasa(config-if)#no ip address 
ciscoasa(config-if)#no shut
ciscoasa(config-if)#
ciscoasa(config-if)#bridge-group 1
ciscoasa(config-if)#
ciscoasa(config-if)#
ciscoasa(config-if)#do show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES manual up                    up      
FastEthernet0/1            unassigned      YES manual up                    up      
ciscoasa(config-if)#
ciscoasa(config-if)#
ciscoasa(config-if)#exit
ciscoasa(config)#
ciscoasa(config)#
ciscoasa(config)#interface ?
  Async              Async interface
  BVI                Bridge-Group Virtual Interface
  CDMA-Ix            CDMA Ix interface
  CTunnel            CTunnel interface
  Dialer             Dialer interface
  FastEthernet       FastEthernet IEEE 802.3
  Group-Async        Async Group interface
  Lex                Lex interface
  Loopback           Loopback interface
  MFR                Multilink Frame Relay bundle interface
  Multilink          Multilink-group interface

ciscoasa(config)#          


.. now we will assign single ip address per bridge group.
.. this will use for management purpose like telnet,ssh,http,https
.. snmp,syslog,tftp and ftp. if there are multiple security context
.. then we have to provide ip address to each bridge group per 
.. security context.

ciscoasa(config)#interface bvi 1 
ciscoasa(config-if)#ip address 192.168.100.100 255.255.255.0
ciscoasa(config-if)#no shut
ciscoasa(config-if)#

ciscoasa(config-if)#do show ip interf brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES manual up                    up      
FastEthernet0/1            unassigned      YES manual up                    up      
BVI1                       192.168.100.100 YES manual up                    up      
ciscoasa(config-if)#

.. now as dynamic routing protocol is not possible when firewall running as 
.. transparent mode we need to configure static route for the connectivity 
.. and default route also for outer connectivity.


ciscoasa(config)# route ..interface.. ..net/mask.. ..metric..

.. metric is used to tell the router how many hop away is our destination
.. network. if metric omitted then it is default one hop.
.. we should also configure static route for voice traffic when the 
.. gateway is more than one hop away like above configuration.

.. packet inspections as well as all the security policies are permitted
.. like routed firewall mode when asa is running in transparent mode. however
.. there are some difference between in both mode like below.

.. arp packets are permitted without any explicity acl
.. broadcast and multicast packets are not permitted without any explicit acl
.. non-ip packets are permitted with the help of ethertype acl

.. when we are permitting any broadcast or multicast based protocols to pass
.. through asa we need to apply an acl in an interface inbound directions.
.. but for the protocols which are bidirectional we can place them inbound
.. on the both interface. this kind of broadcasting/multicasting acl should
.. be more specific. like below

.. when an asa has two routers on the both inside and outside interface and 
.. need to pass ospf related multicas at 224.0.0.5 and 224.0.0.6 then we place
.. the access list like below. note here the placing order in of the access-list

ciscoasa(config)# access-list extra-traffic extended permit ospf any host 224.0.0.5
ciscoasa(config)# access-list extra-traffic extended permit ospf any host 224.0.0.6
ciscoasa(config)# access-group extra-traffic in interface outside
ciscoasa(config)# access-group extra-traffic in interface inside

.... ether-type access-list

.. ethertype access-list has the syntax like below

ciscoasa(config)# show firewall 
Firewall mode: Router

ciscoasa(config)# firewall transparent 
pixfirewall(config)# 
pixfirewall(config)# access-list ?

configure mode commands/options:
  WORD < 241 char  Access list identifier
  alert-interval   Specify the alert interval for generating syslog message 
                   106001 which alerts that the system has reached a deny
                   flow maximum. If not specified, the default value is 300 sec
  deny-flow-max    Specify the maximum number of concurrent deny flows that can
                   be created. If not specified, the default value is 4096

pixfirewall(config)# access-list testing-ether ?

configure mode commands/options:
  deny       Specify packets to reject
  ethertype  Configure access policy for non IP traffic through the
             system when configured in transparent mode
  extended   Configure access policy for IP traffic through the system
  line       Use this to specify line number at which ACE should be entered
  permit     Specify packets to forward
  remark     Specify a comment (remark) for the access-list after this
             keyword
  standard   Use this to configure policy having destination host or network
             only

pixfirewall(config)# access-list testing-ether ethertype ?

configure mode commands/options:
  deny    Specify packets to reject
  permit  Specify packets to forward

pixfirewall(config)# access-list testing-ether ethertype permit ?

configure mode commands/options:
  bpdu
  ipx
  mpls-unicast
  mpls-multicast
  any
  <0x600-0xffff>  Specify ethertype value

pixfirewall(config)# access-list testing-ether ethertype permit mpls-multicast ?

.. one of the example can be like below

ciscoasa(config)# access-list MY-ETHERTYPES ethertype permit bpdu
ciscoasa(config)# access-list MY-ETHERTYPES ethertype permit 0x22f3
ciscoasa(config)# access-group MY-ETHERTYPES in interface outside
ciscoasa(config)# access-group MY-ETHERTYPES in interface inside

.. note here that access-list is place in both interface inbound direction. 

.................. arp and arp inspection .......................


ciscoasa(config)# arp inside 192.168.100.222 0000.2222.2222
ciscoasa(config)# arp outside 192.168.100.1 0000.1111.1111
ciscoasa(config)# arp-inspection inside enable
ciscoasa(config)# arp-inspection outside enable


ciscoasa# show arp-inspection
interface 	arp-inspection 	miss
----------------------------------------------------
outside 	enabled 	flood
inside 		enabled 	flood
ciscoasa#
