Router>
Router>
Router>ena
outer#
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.

Router(config)#ip domain?
domain  domain-list  domain-lookup  domain-name

Router(config)#ip domain-name masum.com
Router(config)#
Router(config)#

outer(config)#crypto key generate rsa modulus 1024
% Please define a hostname other than Router.

Router(config)#hostname masum

masum(config)#crypto key generate rsa modulus 1024
The name for the keys will be: masum.masum.com

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

masum(config)#
*Mar  1 00:33:07.091: %SSH-5-ENABLED: SSH 1.99 has been enabled
masum(config)#
masum(config)#line con
masum(config)#line console 0
masum(config-line)#password cisco
masum(config-line)#login
masum(config-line)#exit
masum(config)#line vty 0 15
masum(config-line)#password cisco
masum(config-line)#
masum(config-line)#
masum(config-line)#login
masum(config-line)#
masum(config)#username masum ?
  aaa                  AAA directive
  access-class         Restrict access by access-class
  autocommand          Automatically issue a command after the user logs in
  callback-dialstring  Callback dialstring
  callback-line        Associate a specific line with this callback
  callback-rotary      Associate a rotary group with this callback
  dnis                 Do not require password when obtained via DNIS
  nocallback-verify    Do not require authentication after callback
  noescape             Prevent the user from using an escape character
  nohangup             Do not disconnect after an automatic command
  nopassword           No password is required for the user to log in
  one-time             Specify that the username/password is valid for only one
                       time
  password             Specify the password for the user
  privilege            Set user privilege level
  secret               Specify the secret for the user
  user-maxlinks        Limit the user's number of inbound links
  view                 Set view name
  <cr>

masum(config)#username masum password ?
  0     Specifies an UNENCRYPTED password will follow
  7     Specifies a HIDDEN password will follow
  LINE  The UNENCRYPTED (cleartext) user password


masum(config)#username masum password masum03
masum(config)#
masum(config)#line
masum(config)#line vt
masum(config)#line vty 0 15 ?
  <cr>

masum(config)#line vty 0 15
masum(config-line)#?
asum(config-line)#ip tcp ?
  input-coalesce-threshold  Set the threshold that triggers packet coalescing
                            (20 default)

asum(config-line)#login local ?
  <cr>

masum(config-line)#
masum(config-line)#
masum(config-line)#exit
masum(config)#
masum(config)#ip ss
masum(config)#ip ssh ?
  authentication-retries  Specify number of authentication retries
  break-string            break-string
  logging                 Configure logging for SSH
  maxstartups             Maximum concurrent sessions allowed
  port                    Starting (or only) Port number to listen on
  rsa                     Configure RSA keypair name for SSH
  source-interface        Specify interface for source address in SSH
                          connections
  time-out                Specify SSH time-out interval
  version                 Specify protocol version to be supported

masum(config)#ip ssh ver
masum(config)#ip ssh version ?
  <1-2>  Protocol version

masum(config)#ip ssh version 2
masum(config)#ip ssh au
masum(config)#ip ssh authentication-retries 3 ?
  <cr>

masum(config)#ip ssh authentication-retries 3
masum(config)#ip ssh logg
masum(config)#ip ssh logging ?
  events  Log SSH events

masum(config)#ip ssh logging ev
masum(config)#ip ssh logging events ?
  <cr>

masum(config)#ip ssh logging events

masum(config-line)#tr
masum(config-line)#transport ?
  input      Define which protocols to use when connecting to the terminal
             server
  output     Define which protocols to use for outgoing connections
  preferred  Specify the preferred protocol to use

masum(config-line)#transport in
masum(config-line)#transport input ?
  all      All protocols
  lapb-ta  LAPB Terminal Adapter
  lat      DEC LAT protocol
  mop      DEC MOP Remote Console Protocol
  none     No protocols
  pad      X.3 PAD
  rlogin   Unix rlogin protocol
  ssh      TCP/IP SSH protocol
  telnet   TCP/IP Telnet protocol
  udptn    UDPTN async via UDP protocol
  v120     Async over ISDN

masum(config-line)#transport input ssh ?
  lapb-ta  LAPB Terminal Adapter
  lat      DEC LAT protocol
  mop      DEC MOP Remote Console Protocol
  pad      X.3 PAD
  rlogin   Unix rlogin protocol
  telnet   TCP/IP Telnet protocol
  udptn    UDPTN async via UDP protocol
  v120     Async over ISDN
  <cr>

masum(config-line)#transport input ssh telnet ?
  lapb-ta  LAPB Terminal Adapter
  lat      DEC LAT protocol
  mop      DEC MOP Remote Console Protocol
  pad      X.3 PAD
  rlogin   Unix rlogin protocol
  udptn    UDPTN async via UDP protocol
  v120     Async over ISDN
  <cr>

masum(config-line)#transport input ssh telnet
masum(config-line)#do show
% Type "show ?" for a list of subcommands
masum(config-line)#do show run | begin line
line con 0
 password cisco
 logging synchronous
 login
line aux 0
line vty 0 4
 password cisco
 login
 transport input telnet ssh
line vty 5 15
 password cisco
 login
 transport input telnet ssh
!
!
end

masum(config-line)#do show ssh
%No SSHv2 server connections running.
%No SSHv1 server connections running.
masum(config-line)#do show ip ssh
SSH Enabled - version 2.0
Authentication timeout: 120 secs; Authentication retries: 3
masum(config-line)#exit
masum(config)#
masum(config)#exit
masum#show ip
*Mar  1 00:41:35.723: %SYS-5-CONFIG_I: Configured from console by console
masum#show ip ssh ?
  |  Output modifiers
  <cr>

masum#show ip ssh
SSH Enabled - version 2.0
Authentication timeout: 120 secs; Authentication retries: 3
masum#


verification


masum(config-line)#
*Mar  1 00:48:57.683: %SSH-5-SSH2_SESSION: SSH2 Session request from 10.10.10.1 (tty = 0) using crypto cipher 'aes128-cbc', hmac 'hmac-md5' Succeeded
masum(config-line)#
*Mar  1 00:49:30.547: %SSH-5-SSH2_USERAUTH: User 'masum' authentication for SSH2 Session from 10.10.10.1 (tty = 0) using crypto cipher 'aes128-cbc', hmac 'hmac-md5' Failed
*Mar  1 00:49:30.547: %SSH-5-SSH2_CLOSE: SSH2 Session from 10.10.10.1 (tty = 0) for user 'masum' using crypto cipher 'aes128-cbc', hmac 'hmac-md5' closed
masum(config-line)#
masum(config-line)#
*Mar  1 00:49:48.971: %SSH-5-SSH2_SESSION: SSH2 Session request from 10.10.10.1 (tty = 0) using crypto cipher 'aes128-cbc', hmac 'hmac-md5' Succeeded
masum(config-line)#
*Mar  1 00:49:52.939: %SSH-5-SSH2_USERAUTH: User 'masum' authentication for SSH2 Session from 10.10.10.1 (tty = 0) using crypto cipher 'aes128-cbc', hmac 'hmac-md5' Succeeded
masum(config-line)#
masum(config-line)#
masum(config-line)#exit
masum(config)#
masum(config)#
masum(config)#exit
masum#
masum#show ssh
Connection Version Mode Encryption  Hmac	 State	               Username
98         2.0     IN   aes128-cbc  hmac-md5     Session started       masum
98         2.0     OUT  aes128-cbc  hmac-md5     Session started       masum
%No SSHv1 server connections running.
masum#
*Mar  1 00:50:51.199: %SYS-5-CONFIG_I: Configured from console by console
masum#
masum#show ip ssh
SSH Enabled - version 2.0
Authentication timeout: 120 secs; Authentication retries: 3
masum#
