


...................... stp configuration .....................


.. by default stp is enable for all vlans. but we can also
.. configure stp for only specific vlan like below.

R1(config)#spanning-tree ?
  backbonefast  Enable BackboneFast Feature
  portfast      Spanning tree portfast options
  uplinkfast    Enable UplinkFast Feature
  vlan          VLAN Switch Spanning Tree

R1(config)#spanning-tree vlan ?
  <1-1005>  Spanning tree VLAN id

R1(config)#spanning-tree vlan 

.. if also we need to activate stp on a particular port then we do 
.. that like below.

R2(config)#interface fastEthernet 1/2
R2(config-if)#spanning-tree ?
  cost           Change an interface's spanning tree path cost
  port-priority  Change an interface's spanning tree priority
  portfast       Enable an interface to move directly to forwarding on link up
  vlan           VLAN Switch Spanning Tree

R2(config-if)#spanning-tree vlan ?
  <1-1005>  Spanning tree VLAN id

R2(config-if)#spanning-tree vlan 

... root bridge selection

.. root bridge selection has the following criteria.
.. lowest bridge id: lowest priority + lowest mac address

... root bridge configuration.

.. for stp bridge id catalyst switches use the following rules.
.. traditional 802.1d bridge id: which is unique mac address along with 
.. 16bit bridge priority value.
.. extended 802.1t system id: (4bit priority + 12bit vlan) along with 
.. non unique mac address.

.. moreover if the switch cant support 1024 unique mac address then system id
.. enabled by default.otherwise traditional bridge id is used. to use the 
.. system id 

R2(config)# spanning-tree extend system-id

.. configuring the bridge id for the stp operation done by following.

R1(config)#spanning-tree ?
  backbonefast  Enable BackboneFast Feature
  portfast      Spanning tree portfast options
  uplinkfast    Enable UplinkFast Feature
  vlan          VLAN Switch Spanning Tree

R1(config)#spanning-tree vlan ?
  <1-1005>  Spanning tree VLAN id

R1(config)#spanning-tree vlan 1 ?
  forward-time  Set the forward delay for the spanning tree
  hello-time    Set the hello interval for the spanning tree
  max-age       Set the max age interval for the spanning tree
  priority      Set the bridge priority for the spanning tree
  root          Configure switch as root
  <cr>

R1(config)#spanning-tree vlan 1 priority ?
  <0-65535>  bridge priority

R1(config)#spanning-tree vlan 1 priority 

.. the lowest bridge priority than default 32678 will become
.. root bridge if the traditional bridge id is configured.
.. if system id is configured the default 32678 plus with 
.. vlan id is used. same here the lowest id will become the root
.. bridge.

.. alternatively we can set a switch as root bridge for a 
.. particular vlan like below.

R1(config)#spanning-tree vlan 5 ?
  forward-time  Set the forward delay for the spanning tree
  hello-time    Set the hello interval for the spanning tree
  max-age       Set the max age interval for the spanning tree
  priority      Set the bridge priority for the spanning tree
  root          Configure switch as root
  <cr>

R1(config)#spanning-tree vlan 5 root ?
  primary    Configure this switch as primary root for this spanning tree
  secondary  Configure switch as secondary root

R1(config)#spanning-tree vlan 5 root primary

.. so that this switch will always become root for vlan 5.

... portfast,uplinkfast,backbonefast

.. portfast 

R1(config)#spanning-tree ?
  backbonefast  Enable BackboneFast Feature
  portfast      Spanning tree portfast options
  uplinkfast    Enable UplinkFast Feature
  vlan          VLAN Switch Spanning Tree

R1(config)#spanning-tree portfast ?
  bpduguard  Enable portfast bpdu guard on this switch

R1(config)#spanning-tree portfast bpduguard ?
  <cr>

R1(config)#spanning-tree portfast bpduguard 

.. uplinkfast

R1(config)#spanning-tree uplinkfast ?
  max-update-rate  Rate at which station address updates are sent
  <cr>

R1(config)#spanning-tree uplinkfast 

.. backbonefast

R1(config)#spanning-tree backbonefast 
R1(config)#
R1(config)#do show spanning-tree backbonefast
BackboneFast is enabled

BackboneFast statistics
-----------------------
Number of transition via backboneFast (all VLANs)           : 0
Number of inferior BPDUs received (all VLANs)               : 0
Number of RLQ request PDUs received (all VLANs)             : 0
Number of RLQ response PDUs received (all VLANs)            : 0
Number of RLQ request PDUs sent (all VLANs)                 : 0
Number of RLQ response PDUs sent (all VLANs)                : 0
R1(config)#

... monitoring stp

R1#show spanning-tree 

 VLAN1 is executing the ieee compatible Spanning Tree protocol
  Bridge Identifier has priority 16384, address c200.10e3.0000
  Configured hello time 2, max age 20, forward delay 15
  Current root has priority 8192, address c201.10e3.0000
  Root port is 41 (FastEthernet1/0), cost of root path is 38
  Topology change flag not set, detected flag not set
  Number of topology changes 2 last change occurred 01:09:36 ago
          from FastEthernet1/1
  Times:  hold 1, topology change 35, notification 2
          hello 2, max age 20, forward delay 15 
  Timers: hello 0, topology change 0, notification 0, aging 300

 Port 41 (FastEthernet1/0) of VLAN1 is forwarding
   Port path cost 19, Port priority 128, Port Identifier 128.41.
   Designated root has priority 8192, address c201.10e3.0000
   Designated bridge has priority 32768, address c202.10e3.0000
   Designated port id is 128.41, designated path cost 19
   Timers: message age 2, forward delay 0, hold 0
   Number of transitions to forwarding state: 1
   BPDU: sent 11433, received 2047

 Port 42 (FastEthernet1/1) of VLAN1 is blocking
   Port path cost 19, Port priority 128, Port Identifier 128.42.
   Designated root has priority 8192, address c201.10e3.0000
   Designated bridge has priority 32768, address c202.10e3.0000
   Designated port id is 128.42, designated path cost 19
   Timers: message age 3, forward delay 0, hold 0
   Number of transitions to forwarding state: 1
   BPDU: sent 11431, received 2046

 Port 55 (FastEthernet1/14) of VLAN1 is forwarding
   Port path cost 19, Port priority 128, Port Identifier 128.55.
   Designated root has priority 8192, address c201.10e3.0000
   Designated bridge has priority 16384, address c200.10e3.0000
   Designated port id is 128.55, designated path cost 38
   Timers: message age 0, forward delay 0, hold 0
   Number of transitions to forwarding state: 1
   BPDU: sent 13470, received 0

R1#
R1#show spanning-tree ? 
  <1-255>            Bridge Group number
  active             Report on active interfaces only
  backbonefast       Show spanning tree backbonefast status
  blockedports       Show blocked ports
  bridge             Status and configuration of this bridge
  brief              Brief summary of interface information
  inconsistentports  Show inconsistent ports
  interface          Spanning Tree interface status and configuration
  root               Status and configuration of the root bridge
  summary            Summary of port states
  uplinkfast         Show spanning tree uplinkfast status
  vlan               VLAN Switch Spanning Trees
  |                  Output modifiers
  <cr>

R1#show spanning-tree summary 
Root bridge for: none.
PortFast BPDU Guard is enabled
UplinkFast is disabled
BackboneFast is enabled

Name                 Blocking Listening Learning Forwarding STP Active
-------------------- -------- --------- -------- ---------- ----------
VLAN1                1        0         0        2          3         
-------------------- -------- --------- -------- ---------- ----------
              1 VLAN 1        0         0        2          3         

BackboneFast statistics
-----------------------
Number of transition via backboneFast (all VLANs)           : 0
Number of inferior BPDUs received (all VLANs)               : 0
Number of RLQ request PDUs received (all VLANs)             : 0
Number of RLQ response PDUs received (all VLANs)            : 0
Number of RLQ request PDUs sent (all VLANs)                 : 0
Number of RLQ response PDUs sent (all VLANs)                : 0
R1#
R1#show spanning-tree ?  
  <1-255>            Bridge Group number
  active             Report on active interfaces only
  backbonefast       Show spanning tree backbonefast status
  blockedports       Show blocked ports
  bridge             Status and configuration of this bridge
  brief              Brief summary of interface information
  inconsistentports  Show inconsistent ports
  interface          Spanning Tree interface status and configuration
  root               Status and configuration of the root bridge
  summary            Summary of port states
  uplinkfast         Show spanning tree uplinkfast status
  vlan               VLAN Switch Spanning Trees
  |                  Output modifiers
  <cr>

R1#show spanning-tree root 
VLAN1            
  Root ID    Priority    8192
             Address     c201.10e3.0000
             Cost        38
             Port        41 (FastEthernet1/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

R1#show spanning-tree bridge 
VLAN1            
  Bridge ID  Priority    16384
             Address     c200.10e3.0000
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
R1#
R1#show spanning-tree uplinkfast 
UplinkFast is disabled

R1#show spanning-tree backbonefast 
BackboneFast is enabled

BackboneFast statistics
-----------------------
Number of transition via backboneFast (all VLANs)           : 0
Number of inferior BPDUs received (all VLANs)               : 0
Number of RLQ request PDUs received (all VLANs)             : 0
Number of RLQ response PDUs received (all VLANs)            : 0
Number of RLQ request PDUs sent (all VLANs)                 : 0
Number of RLQ response PDUs sent (all VLANs)                : 0
R1#

.. when a switch is the root we got the following output

R2#show spanning-tree summary 
Root bridge for: VLAN1.
PortFast BPDU Guard is disabled
UplinkFast is disabled
BackboneFast is disabled

Name                 Blocking Listening Learning Forwarding STP Active
-------------------- -------- --------- -------- ---------- ----------
VLAN1                0        0         0        2          2         
-------------------- -------- --------- -------- ---------- ----------
              1 VLAN 0        0         0        2          2         
R2#
R2#
R2#show sp
R2#show spanning-tree root
VLAN1            
  Root ID    Priority    8192
             Address     c201.10e3.0000
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
R2#

.. it says this switch is the root bridge from the output of 
.. show spanning-tree root command

R2#show spanning-tree interface fastEthernet 1/0
 Port 41 (FastEthernet1/0) of VLAN1 is forwarding
   Port path cost 19, Port priority 128, Port Identifier 128.41.
   Designated root has priority 8192, address c201.10e3.0000
   Designated bridge has priority 8192, address c201.10e3.0000
   Designated port id is 128.41, designated path cost 0
   Timers: message age 0, forward delay 0, hold 0
   Number of transitions to forwarding state: 1
   BPDU: sent 13736, received 0
R2#










